#### WorksharingSaveAsOptions Members

---

|  |
| --- |
| WorksharingSaveAsOptions Class   Constructors   Methods   Properties   See Also |

The  WorksharingSaveAsOptions  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | WorksharingSaveAsOptions | Constructs a new WorksharingSaveAsOptions with default settings. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  WorksharingSaveAsOptions |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ClearTransmitted | For a transmitted model opened with DetachAndPreserveWorksets, clear its transmitted flag in the Save/SaveAs operation. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | OpenWorksetsDefault | The default set of user-worksets to open when opening the model in the UI. Default is AskUserToSpecify. |
| Public property | SaveAsCentral | Whether to save the new model as a central instead of local model. True: save as a central model. Default is false: save as a local model. |

# See Also

WorksharingSaveAsOptions Class

Autodesk.Revit.DB Namespace